opencctv-web/app/controllers/analytic_instance_streams_controller.rb

SELECT  1 AS one FROM `analytic_instance_streams`  WHERE (`analytic_instance_streams`.`analytic_input_stream_id` = BINARY 1 AND `analytic_instance_streams`.`analytic_instance_id` = 1) LIMIT 1
SELECT  `analytic_instances`.* FROM `analytic_instances`  WHERE `analytic_instances`.`id` = 1 LIMIT 1
SELECT  `analytics`.* FROM `analytics`  WHERE `analytics`.`id` = 1 LIMIT 1
SELECT  `streams`.* FROM `streams`  WHERE `streams`.`id` = 1 LIMIT 1
SELECT `analytic_input_streams`.* FROM `analytic_input_streams`  WHERE `analytic_input_streams`.`analytic_id` = 1
INSERT INTO `analytic_instance_streams` (`analytic_input_stream_id`, `analytic_instance_id`, `created_at`, `stream_id`, `updated_at`) VALUES (1, 1, '2016-07-27 07:17:08', 1, '2016-07-27 07:17:08')
---
  def create
    @analytic_instance_stream = AnalyticInstanceStream.new
    @analytic_instance_stream.analytic_instance = @analytic_instance

    if params[:analytic_instance_stream][:analytic_input_stream_id].present?
      @analytic_instance_stream.analytic_input_stream = AnalyticInputStream.find(params[:analytic_instance_stream][:analytic_input_stream_id])
    end

    if params[:analytic_instance_stream][:stream_id].present?
      @analytic_instance_stream.stream = Stream.find(params[:analytic_instance_stream][:stream_id])
    end

    @analytic_instance_stream.config = File.read(Rails.root.join('app/uploads/configs', 'framegraber.yml'))
    @analytic_instance_stream.save

DELETE FROM `analytic_instance_streams` WHERE `analytic_instance_streams`.`id` = 4
---
  def destroy
    @analytic_instance_stream.destroy

SELECT  `analytic_instance_streams`.* FROM `analytic_instance_streams`  WHERE `analytic_instance_streams`.`id` = 4 LIMIT 1
SELECT  `streams`.* FROM `streams`  WHERE `streams`.`id` = 2 LIMIT 1
---
    def set_analytic_instance_stream
      @analytic_instance_stream = AnalyticInstanceStream.find(params[:id])

SELECT  `analytic_instances`.* FROM `analytic_instances`  WHERE `analytic_instances`.`id` = 5 LIMIT 1
---
    def set_analytic_instance
      @analytic_instance = AnalyticInstance.find(params[:analytic_instance_id])