opencctv-web/app/controllers/analytics_controller.rb

SELECT `analytics`.* FROM `analytics`
---
  def index
    @analytics = Analytic.all

INSERT INTO `analytics` (`created_at`, `description`, `filename`, `log`, `name`, `updated_at`, `verified`) VALUES ('2016-07-27 07:06:27', '', 'a8477c09-319a-4d31-b061-cc5739b9c325', '<strong>All the files</strong><p>zip<br>analytic.config<br>libFaceDetectionAnalytic.so<br></p>\n<strong>Shared Library found</strong><p>libFaceDetectionAnalytic.so</p>\n<strong>Analytic plugin verified!</strong>', 'Fake_FaceDetection', '2016-07-27 07:06:27', 1)
INSERT INTO `analytic_input_streams` (`analytic_id`, `created_at`, `description`, `name`, `updated_at`) VALUES (1, '2016-07-27 07:06:27', 'This analytic needs only 1 Input Stream', 'default', '2016-07-27 07:06:27')
---
  def create
    @analytic = Analytic.new(analytic_params)

    uploaded_io = params[:analytic][:file]
    if(uploaded_io && uploaded_io.content_type.to_s == 'application/zip')
      @analytic.filename = SecureRandom.uuid.to_s
      File.open(Rails.root.join('app/uploads', 'analytics', (@analytic.filename  + '.zip')), 'wb') do |f|
        f.write(uploaded_io.read)
      end

      validation_result = @analytic.validate_plugin_archive()

      @analytic.verified = validation_result[:verified]
      if(@analytic.verified?)
        flash[:notice] = 'Uploaded the new analytic and verified.'
      else
        flash[:error] = 'Failed to verify the uploaded analytic.'
      end

      validation_result[:html_content].nil? ? @analytic.log = '' : @analytic.log = validation_result[:html_content]

      @analytic.save

      if (!@analytic.errors.any?)
        input_streams = validation_result[:input_streams]
        input_streams.each do |in_str|
          @analytic.analytic_input_streams.push(in_str)

SELECT  `analytics`.* FROM `analytics`  WHERE `analytics`.`id` = 1 LIMIT 1
---
    def set_analytic
      @analytic = Analytic.find(params[:id])