opencctv-web/app/controllers/analytic_instances_controller.rb

  def index

    if isOrganization?
      @analytic_instances = AnalyticInstance.where(group_user_id: @groupList)

    else
      @analytic_instances = AnalyticInstance.where(user_id: current_user.id)
---
SELECT `analytic_instances`.* FROM `analytic_instances`  WHERE `analytic_instances`.`user_id` = 1

  def create

    if isOrganization?
      @analytic_instance = AnalyticInstance.new(:name => params[:analytic_instance][:name],
                                                :description => params[:analytic_instance][:description],
                                                :analytic_id => params[:analytic_instance][:analytic_id],
                                                :notification_id => params[:analytic_instance][:notification_id],
                                                #:user_id => current_user.id,
                                                :group_user_id => params[:analytic_instance][:group_user_id])

      @analytic_instance.save
---
INSERT INTO `analytic_instances` (`analytic_id`, `created_at`, `description`, `name`, `notification_id`, `updated_at`, `user_id`) VALUES (1, '2016-07-27 08:15:53', '', 'analytic_instance', 1, '2016-07-27 08:15:53', 1)

  def update
    @analytic_instance.update(analytic_instance_params)
---
UPDATE `analytic_instances` SET `notification_id` = 1, `updated_at` = '2016-07-27 08:07:19' WHERE `analytic_instances`.`id` = 3

  def destroy
    @analytic_instance.destroy
---
DELETE FROM `analytic_instances` WHERE `analytic_instances`.`id` = 1

  def startAnalytic
    @analytic_instance.update(status: 'true')

    puts "xxxxx"
    @openCctvServer = OpenCctvServer.first()
---
UPDATE `analytic_instances` SET `status` = 1, `updated_at` = '2016-08-22 07:59:44' WHERE `analytic_instances`.`id` = 6
SELECT  `open_cctv_servers`.* FROM `open_cctv_servers`   ORDER BY `open_cctv_servers`.`id` ASC LIMIT 1

  def stopAnalytic
    @analytic_instance.update(status: 'false')
    @openCctvServer = OpenCctvServer.first()
---
UPDATE `analytic_instances` SET `status` = 0, `updated_at` = '2016-08-22 08:00:02' WHERE `analytic_instances`.`id` = 6
SELECT  `open_cctv_servers`.* FROM `open_cctv_servers`   ORDER BY `open_cctv_servers`.`id` ASC LIMIT 1

  def set_analytic_instance

    if isOrganization?
      #Protecting user is not in group but try to show
      # @vms = Vms.where(:id => params[:id],
      #                 :group_user_id =>  GroupUser.joins(:org_users)
      #                                       .where(:org_id => session[:org_id],
      #                                              :org_users => {:user_id => current_user.id},
      #                                             :group_users => {:id => params[:group_user_id]}).pluck(:group_user_id)).first()

      params[:group_user_id].nil? ?
          @analytic_instance = AnalyticInstance.where(:id => params[:id], :group_user_id => params[:analytic_instance][:group_user_id]).first()
---
SELECT  `analytic_instances`.* FROM `analytic_instances`  WHERE `analytic_instances`.`id` = 6 AND `analytic_instances`.`user_id` = 1  ORDER BY `analytic_instances`.`id` ASC LIMIT 1