opencctv-web/app/controllers/analytic_input_streams_controller.rb

    def set_analytic_input_stream
      @analytic_input_stream = AnalyticInputStream.find(params[:id])
---
SELECT  `analytic_input_streams`.* FROM `analytic_input_streams`  WHERE `analytic_input_streams`.`id` = 1 LIMIT 1

    def set_analytic
      @analytic = Analytic.find(params[:analytic_id])
---
SELECT  `analytics`.* FROM `analytics`  WHERE `analytics`.`id` = 1 LIMIT 1