opencctv-web/app/controllers/cameras_controller.rb

INSERT INTO `cameras` (`camera_id`, `created_at`, `description`, `name`, `updated_at`, `vms_id`) VALUES ('rtsph264720p', '2016-07-27 08:00:38', '', 'lilin-254', '2016-07-27 08:00:38', 2)
---
  def create
    @camera = @vms.cameras.create(:name => params[:camera][:name], :camera_id => params[:camera][:camera_id], :description => params[:camera][:description])

UPDATE `cameras` SET `camera_id` = '/rtsph264720p', `updated_at` = '2016-07-27 08:04:29' WHERE `cameras`.`id` = 2
---
  def update
    @camera.update(:name => params[:camera][:name], :camera_id => params[:camera][:camera_id], :description => params[:camera][:description])

DELETE FROM `cameras` WHERE `cameras`.`id` = 2
---
  def destroy
    @camera.destroy

SELECT  `cameras`.* FROM `cameras`  WHERE `cameras`.`id` = 2 LIMIT 1
---
  def set_camera
    @camera = Camera.find(params[:id])

SELECT  `vms_connectors`.* FROM `vms_connectors`  WHERE `vms_connectors`.`id` = 4 LIMIT 1
---
  def set_vms_connector
    @vms_connector = Vms.find(params[:vms_id]).vms_connector