opencctv-web/app/controllers/notifications_controller.rb

  def create
    if isOrganization?

      @notification = Notification.new(:title => params[:notification][:title],
                                       :email => params[:notification][:email],
                                       :to_user => params[:notification][:to_user],
                                       #:user_id => current_user.id,
                                       :group_user_id => params[:notification][:group_user_id])

      @notification.save
---
INSERT INTO `notifications` (`created_at`, `title`, `to_user`, `updated_at`, `user_id`) VALUES ('2016-07-27 08:07:10', 'notification', '', '2016-07-27 08:07:10', 1)

  def set_notification


    if isOrganization?
      #Protecting user is not in group but try to show
      # @vms = Vms.where(:id => params[:id],
      #                 :group_user_id =>  GroupUser.joins(:org_users)
      #                                       .where(:org_id => session[:org_id],
      #                                              :org_users => {:user_id => current_user.id},
      #                                             :group_users => {:id => params[:group_user_id]}).pluck(:group_user_id)).first()


      params[:group_user_id].nil? ?
          @notification = Notification.where(:id => params[:notification][:id], :group_user_id => params[:notification][:group_user_id]).first()
---
SELECT  `notifications`.* FROM `notifications`  WHERE `notifications`.`id` = 1 AND `notifications`.`user_id` = 1  ORDER BY `notifications`.`id` ASC LIMIT 1