opencctv-web/app/controllers/open_cctv_servers_controller.rb

  def index
    @open_cctv_server = OpenCctvServer.last
---
SELECT  `open_cctv_servers`.* FROM `open_cctv_servers`   ORDER BY `open_cctv_servers`.`id` DESC LIMIT 1

  def show
    #@open_cctv_server = OpenCctvServer.find(params[:id])
    @open_cctv_server = OpenCctvServer.last
---
SELECT  `open_cctv_servers`.* FROM `open_cctv_servers`   ORDER BY `open_cctv_servers`.`id` DESC LIMIT 1

  def create
    @open_cctv_server = OpenCctvServer.new(open_cctv_server_params)
    @open_cctv_server.save
---
INSERT INTO `open_cctv_servers` (`created_at`, `host`, `name`, `port`, `updated_at`) VALUES ('2016-07-27 07:18:59', '172.18.0.5', 'OpenCCTV Server', 4444, '2016-07-27 07:18:59')

  def update
    if(@open_cctv_server.status =='Running')
      flash[:alert] = 'It is not possible to edit the Open CCTV Server details while it is running'
    else
      @open_cctv_server.status = 'Unknown'
      @open_cctv_server.update(open_cctv_server_params)
---
UPDATE `open_cctv_servers` SET `host` = '192.41.170.168', `updated_at` = '2016-08-01 08:09:08' WHERE `open_cctv_servers`.`id` = 1

  def set_open_cctv_server
    @open_cctv_server = OpenCctvServer.find(params[:id])
---
SELECT  `open_cctv_servers`.* FROM `open_cctv_servers`  WHERE `open_cctv_servers`.`id` = 1 LIMIT 1