opencctv-web/app/controllers/streams_controller.rb

  def create
    @stream = @camera.streams.create(:name => params[:stream][:name], :width => params[:stream][:width], :height => params[:stream][:height], :keep_aspect_ratio => params[:stream][:keep_aspect_ratio], :allow_upsizing => params[:stream][:allow_upsizing], :compression_rate => params[:stream][:compression_rate], :description => params[:stream][:description])
---
INSERT INTO `streams` (`allow_upsizing`, `camera_id`, `compression_rate`, `created_at`, `description`, `height`, `keep_aspect_ratio`, `name`, `updated_at`, `width`) VALUES (0, 2, 90, '2016-07-27 08:06:59', '', 720, 0, 'Lilin-RTSP', '2016-07-27 08:06:59', 1280)

  def update
    @stream.update(:name => params[:stream][:name], :width => params[:stream][:width], :height => params[:stream][:height], :keep_aspect_ratio => params[:stream][:keep_aspect_ratio], :allow_upsizing => params[:stream][:allow_upsizing], :compression_rate => params[:stream][:compression_rate], :description => params[:stream][:description])
---
UPDATE `streams` SET `height` = 480, `updated_at` = '2016-08-10 07:39:10', `width` = 720 WHERE `streams`.`id` = 8

def set_stream
  @stream = Stream.find(params[:id])
---
SELECT  `streams`.* FROM `streams`  WHERE `streams`.`id` = 8 LIMIT 1

def set_camera
  @camera = Camera.find(params[:camera_id])
---
SELECT  `cameras`.* FROM `cameras`  WHERE `cameras`.`id` = 8 LIMIT 1

def set_vms_connector
  @vms_connector = Vms.find(params[:vms_id]).vms_connector
---
SELECT  `vms_connectors`.* FROM `vms_connectors`  WHERE `vms_connectors`.`id` = 7 LIMIT 1