opencctv-web/app/controllers/vms_connectors_controller.rb

INSERT INTO `vms_connectors` (`created_at`, `description`, `filename`, `log`, `name`, `updated_at`) VALUES ('2016-07-27 07:51:11', 'Adapted form Hikvision connector', '029040d7-44fa-47f8-abe6-7465ac3eade3', '<strong>All the files</strong><p>zip<br>libHikVisionConnector.so<br></p>\n<strong>Shared Library found</strong><p>libHikVisionConnector.so</p>\n<strong>VMS connector plugin error:</strong><p>libvlc.so.5: cannot open shared object file: No such file or directory</p>', 'RTSP_DirectConector', '2016-07-27 07:51:11')
---
  def create
    @vms_connector = VmsConnector.new(vms_connector_params)
    uploaded_io = params[:vms_connector][:file]
    if(uploaded_io && uploaded_io.content_type.to_s == 'application/zip')
      @vms_connector.filename = SecureRandom.uuid.to_s
      File.open(Rails.root.join('app/uploads', 'vms_connectors', (@vms_connector.filename  + '.zip')), 'wb') do |f|
        f.write(uploaded_io.read)
      end
      if(@vms_connector.validate_plugin_archive())
        flash[:notice] = 'Uploaded the new VMS connector and verified.'
      else
        flash[:error] = 'Failed to verify the uploaded VMS connector.'
      end
      @vms_connector.save

SELECT `vms_connectors`.* FROM `vms_connectors`
---
  def index
    @vms_connectors = VmsConnector.all

DELETE FROM `vms_connectors` WHERE `vms_connectors`.`id` = 2
---
  def destroy
    path_to_file = Rails.root.join('app/uploads', 'vms_connectors', (@vms_connector.filename + '.zip'))
    File.delete(path_to_file) if File.exist?(path_to_file)
    @vms_connector.destroy

SELECT  `vms_connectors`.* FROM `vms_connectors`  WHERE `vms_connectors`.`id` = 3 LIMIT 1
---
  def set_vms_connector
    @vms_connector = VmsConnector.find(params[:id])