opencctv-web/app/controllers/vmses_controller.rb

DELETE FROM `cameras` WHERE `cameras`.`id` = 9
---
  def update
    @vms.update(vms_params)
    if !@vms.errors.any?

      begin
        if (@vms.validate_connection)
          flash[:notice] = 'Successfully connected to the VMS.'
          Camera.destroy_all(vms: @vms)

SELECT  `vms_connectors`.* FROM `vms_connectors`  WHERE `vms_connectors`.`id` = 4 LIMIT 1
---
  def set_vms_connector
    @vms_connector = Vms.find(params[:id]).vms_connector