opencctv-web/app/views/cameras/show.html.erb


  <% if @camera.streams.empty? %>
---
SELECT  1 AS one FROM `streams`  WHERE `streams`.`camera_id` = 1 LIMIT 1
SELECT `streams`.* FROM `streams`  WHERE `streams`.`camera_id` = 1