opencctv-web/app/views/analytic_instances/_form.html.erb

SELECT `analytics`.* FROM `analytics`  WHERE `analytics`.`verified` = 1
---
      <%= f.label :analytic_id, 'Analytic Type' %><br>
      <%= f.collection_select(:analytic_id, Analytic.where(verified: true), :id, :name, {prompt: 'Select Analytic Type'}, {:disabled => params[:action]=="edit"}) %>

SELECT `notifications`.* FROM `notifications`  WHERE `notifications`.`user_id` = 1
---
      <% else %>
          <%= f.collection_select(:notification_id, Notification.where(:user_id => current_user.id), :id, :title,
                                  {prompt: 'Select Notification'},
                                  {:selected => @analytic_instance.notification_id}) %>