opencctv-web/app/views/analytic_instances/show.html.erb

SELECT  1 AS one FROM `analytic_instance_streams`  WHERE `analytic_instance_streams`.`analytic_instance_id` = 1 LIMIT 1
SELECT `analytic_instance_streams`.* FROM `analytic_instance_streams`  WHERE `analytic_instance_streams`.`analytic_instance_id` = 1
---
  <div class="media">
    <%if @analytic_instance.analytic_instance_streams.empty?%>