opencctv-web/app/views/analytics/show.html.erb


  <%if @analytic.analytic_input_streams.empty?%>
---
SELECT  1 AS one FROM `analytic_input_streams`  WHERE `analytic_input_streams`.`analytic_id` = 1 LIMIT 1
SELECT `analytic_input_streams`.* FROM `analytic_input_streams`  WHERE `analytic_input_streams`.`analytic_id` = 1