opencctv-web/app/views/vmses/_form.html.erb

SELECT `vms_connectors`.* FROM `vms_connectors`  WHERE (verified = 1)
---
      <br>
      <%= f.collection_select(:vms_connector_id, VmsConnector.where('verified = 1'), :id, :name, {prompt: 'Select Connector Type'}, {:disabled => params[:action]=="edit"}) %>