opencctv-web/app/views/vmses/show.html.erb


  <%if @vms.cameras.empty?%>
---
SELECT  1 AS one FROM `cameras`  WHERE `cameras`.`vms_id` = 1 LIMIT 1
SELECT `cameras`.* FROM `cameras`  WHERE `cameras`.`vms_id` = 1